4ms/metamodule/firmware/lib/stm32-usb-host-lib/Core/Src/usbh_ctlreq.c
  return status;
}


/**
  * @brief  USBH_ParseCfgDesc
  *         This function Parses the configuration descriptor
  * @param  phost: USB Host handler
  * @param  buf: Buffer where the source descriptor is available
  * @param  length: Length of the descriptor
  * @retval USBH status
  */
static USBH_StatusTypeDef USBH_ParseCfgDesc(USBH_HandleTypeDef *phost, uint8_t *buf, uint16_t length, uint8_t fix_audio_subclass_length)
{
  USBH_CfgDescTypeDef *cfg_desc = &phost->device.CfgDesc;
  USBH_StatusTypeDef           status = USBH_OK;
  USBH_InterfaceDescTypeDef    *pif;
  USBH_EpDescTypeDef           *pep;
  USBH_DescHeader_t            *pdesc;
  uint16_t                     ptr;
  uint8_t                      if_ix = 0U;
  uint8_t                      ep_ix = 0U;

  if (buf == NULL)
  {
    return USBH_FAIL;
  }

  // uint8_t iadmode = 0;
  pdesc = (USBH_DescHeader_t *)(void *)buf;

  /* Make sure that the Configuration descriptor's bLength is equal to USB_CONFIGURATION_DESC_SIZE */
  if (pdesc->bLength != USB_CONFIGURATION_DESC_SIZE)
  {
    pdesc->bLength = USB_CONFIGURATION_DESC_SIZE;
  }

  /* Parse configuration descriptor */
  cfg_desc->bLength             = *(uint8_t *)(buf + 0U);
  cfg_desc->bDescriptorType     = *(uint8_t *)(buf + 1U);
  cfg_desc->wTotalLength        = MIN(((uint16_t) LE16(buf + 2U)), ((uint16_t)USBH_MAX_SIZE_CONFIGURATION));
  cfg_desc->bNumInterfaces      = *(uint8_t *)(buf + 4U);
  cfg_desc->bConfigurationValue = *(uint8_t *)(buf + 5U);
  cfg_desc->iConfiguration      = *(uint8_t *)(buf + 6U);
  cfg_desc->bmAttributes        = *(uint8_t *)(buf + 7U);
  cfg_desc->bMaxPower           = *(uint8_t *)(buf + 8U);

  if (length > USB_CONFIGURATION_DESC_SIZE)
  {
    ptr = USB_LEN_CFG_DESC;
    pif = (USBH_InterfaceDescTypeDef *)NULL;

    while ((if_ix < USBH_MAX_NUM_INTERFACES) && (ptr < cfg_desc->wTotalLength))
    {
      pdesc = USBH_GetNextDesc((uint8_t *)(void *)pdesc, &ptr);

      if (pdesc->bDescriptorType == USB_DESC_TYPE_ASSOC) {
        // iadmode = 1;
        USBH_IfAssocDescTypeDef *piad = (USBH_IfAssocDescTypeDef *)pdesc;
        USBH_DbgLog("USBH_ParseCfgDesc: USB_DESC_TYPE_ASSOC: 0x%02X/x%02X, nif=%d, firstIf=%d",
                    piad->bFunctionClass,
                    piad->bFunctionSubClass,
                    piad->bInterfaceCount,
                    piad->bFirstInterface);
      } else if (pdesc->bDescriptorType == USB_DESC_TYPE_INTERFACE)
      {
        /* Make sure that the interface descriptor's bLength is equal to USB_INTERFACE_DESC_SIZE */
        if (pdesc->bLength != USB_INTERFACE_DESC_SIZE)
        {
          pdesc->bLength = USB_INTERFACE_DESC_SIZE;
        }

        pif = &cfg_desc->Itf_Desc[if_ix];
        USBH_ParseInterfaceDesc(pif, (uint8_t *)(void *)pdesc);
        USBH_DbgLog("Found interface %u: class %u, sub-class %u, protocol %u, endpts %u", 
                if_ix, pif->bInterfaceClass, pif->bInterfaceSubClass, pif->bInterfaceProtocol, pif->bNumEndpoints);

        ep_ix = 0U;
        pep = (USBH_EpDescTypeDef *)NULL;

        while ((ep_ix < pif->bNumEndpoints) && (ptr < cfg_desc->wTotalLength))
        {
          pdesc = USBH_GetNextDesc((uint8_t *)(void *)pdesc, &ptr);

          if (pdesc->bLength == 0) {
              USBH_DbgLog("Descriptor invalid (length 0), aborting");
              break;
          }

          if (pdesc->bDescriptorType == USB_DESC_TYPE_ENDPOINT)
          {

            /* Check if the endpoint is appartening to an audio streaming interface */
            if (fix_audio_subclass_length && (pif->bInterfaceClass == 0x01U) &&
                ((pif->bInterfaceSubClass == 0x02U) || (pif->bInterfaceSubClass == 0x03U)))
            {
              /* Check if it is supporting the USB AUDIO 01 class specification */
              if ((pif->bInterfaceProtocol == 0x00U) && (pdesc->bLength != 0x09U) && (pdesc->bLength != 0x07U))
              {
                USBH_UsrLog("Setting audio streaming subclass length to 9 (was %d) for ep %d", pdesc->bLength, ep_ix);
                pdesc->bLength = 0x09U;
              }
            }
            /* Make sure that the endpoint descriptor's bLength is equal to
               USB_ENDPOINT_DESC_SIZE for all other endpoints types */
            else
            {
              pdesc->bLength = USB_ENDPOINT_DESC_SIZE;
            }

            pep = &cfg_desc->Itf_Desc[if_ix].Ep_Desc[ep_ix];

            status = USBH_ParseEPDesc(phost, pep, (uint8_t *)(void *)pdesc);

            ep_ix++;
          }
        }

        /* Check if the required endpoint(s) data are parsed */
        if (ep_ix < pif->bNumEndpoints)
        {
          USBH_UsrLog("Expected %u endpoints, found %u. Not Supported", pif->bNumEndpoints, ep_ix);
          return USBH_NOT_SUPPORTED;
        }

        if_ix++;
      }
    }

    /* Check if the required interface(s) data are parsed */
    if (if_ix < MIN(cfg_desc->bNumInterfaces, (uint8_t)USBH_MAX_NUM_INTERFACES))
    {
      return USBH_NOT_SUPPORTED;
    }
  }

  return status;
}


/**
  * @brief  USBH_ParseInterfaceDesc
  *         This function Parses the interface descriptor
  * @param  if_descriptor : Interface descriptor destination
  * @param  buf: Buffer where the descriptor data is available
  * @retval None
  */
static void USBH_ParseInterfaceDesc(USBH_InterfaceDescTypeDef *if_descriptor, uint8_t *buf)
{
  if_descriptor->bLength            = *(uint8_t *)(buf + 0U);
  if_descriptor->bDescriptorType    = *(uint8_t *)(buf + 1U);
  if_descriptor->bInterfaceNumber   = *(uint8_t *)(buf + 2U);
  if_descriptor->bAlternateSetting  = *(uint8_t *)(buf + 3U);
  if_descriptor->bNumEndpoints      = MIN(*(uint8_t *)(buf + 4U), USBH_MAX_NUM_ENDPOINTS);
  if_descriptor->bInterfaceClass    = *(uint8_t *)(buf + 5U);
  if_descriptor->bInterfaceSubClass = *(uint8_t *)(buf + 6U);
  if_descriptor->bInterfaceProtocol = *(uint8_t *)(buf + 7U);
  if_descriptor->iInterface         = *(uint8_t *)(buf + 8U);
}


/**
  * @brief  USBH_ParseEPDesc
  *         This function Parses the endpoint descriptor
  * @param  phost: USB Host handler
  * @param  ep_descriptor: Endpoint descriptor destination address
  * @param  buf: Buffer where the parsed descriptor stored
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_ParseEPDesc(USBH_HandleTypeDef *phost, USBH_EpDescTypeDef *ep_descriptor, uint8_t *buf)
{
  USBH_StatusTypeDef status = USBH_OK;

